# Напишите *Задача 20: * В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:A, E, I, O, U, L, N, S, T, R – 1 очко; D, G – 2 очка;
# B, C, M, P – 3 очка; F, H, V, W, Y – 4 очка; K – 5 очков; J, X – 8 очков; Q, Z – 10 очков.
# А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко; Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; Ж, З, Х, Ц, Ч – 5 очков; Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

ala_sample = {"A": 1, "E": 1, "I": 1, "O": 1, "U": 1, "L": 1, "N": 1, "S": 1, "T": 1, "R": 1, "D": 2, "G": 2, "B": 3, "C": 3, "M": 3, "P": 3, "F": 4, "H": 4, "V": 4, "W": 4, "Y": 4, "K": 5, "J": 8, "X": 8, "Q": 10, "Z": 10,"a": 1, "e": 1, "i": 1, "o": 1, "u": 1, "l": 1, "n": 1, "s": 1, "t": 1, "r": 1, "d": 2, "g": 2, "b": 3, "c": 3, "m": 3, "p": 3, "f": 4, "h": 4, "v": 4, "w": 4, "y": 4, "k": 5, "j": 8, "x": 8, "q": 10, "z": 10}
alaru_sample = {"А": 1, "а": 1, "В": 1, "в": 1, "Е": 1, "е": 1, "И": 1, "и": 1, "Н": 1, "н": 1, "О": 1, "о": 1, "Р": 1, "р": 1, "С": 1, "с": 1, "Т": 1, "т": 1, "Д": 2, "д": 2, "к": 2, "К": 2, "Л": 2, "л": 2, "М": 2, "м": 2, "п": 2, "П": 2, "У": 2, "у": 2, "Б": 3, "б": 3, "Г": 3, "г": 3, "Ё": 3, "ё": 3, "Ь": 3, "ь": 3, "Я": 3, "я": 3, "Й": 4, "й": 4, "Ы": 4, "ы": 4, "Ж": 5, "ж": 5, "З": 5, "з": 5, "Х": 5, "х": 5, "Ц": 5, "ц": 5, "Ч": 5, "ч": 5, "Ш": 8, "ш": 8, "Э": 8, "э": 8, "Ю": 8, "ю": 8, "Ф": 10, "ф": 10, "Щ": 10, "щ": 10, "Ъ": 10, "ъ": 10}
k = 0
b = 0
str = input("Введите слово для оценки: ")
print(str)
arr = list(str)
n = len(arr)
for i in range(n):
    if ala_sample.get(arr[i], 0) > 0:
        a = ala_sample.get(arr[i])
        k = a + k
    else:
        a = alaru_sample.get(arr[i])
        b = a + b
print("Стоимость английского слова: ", k, "очков")
print("Стоимость русского слова: ", b, "очков")